<script setup lang="ts">

</script>

<template>
  <div class="p-8 text-gray-300">
    <h2 class="text-3xl flex items-center">
      <UIcon name="i-mdi-face-man-profile" class="text-cyan-500 mr-2" />
      <span>自己紹介</span>
    </h2>
    <p class="mt-8">
      2015年から独学でプログラミングに取り組み、HTML、CSS、JavaScriptを使って最初の一歩を踏み出しました。
      当初はシンプルな1ページのウェブサイトを作るところから始め、思い通りの画面が表示された時の達成感が、
      私をプログラミングの世界へとどっぷりと引き込んでいきました。
      その後、さまざまな技術を学び、現在ではフルスタックエンジニアとして幅広い技術を活用しています。
    </p>
    <p class="mt-4">
      私のキャリアは、営業職としてスタートしました。
      新卒で入社した会社で<span class="font-bold text-white">3年間営業</span>として経験を積んだ後、第二新卒としてエンジニアの道に進むことを決意しました。
      エンジニアに転身してからは、ソフトバンクの情報システム部門に客先常駐し、社内向けのFAQサイトや問い合わせ管理システムを構築・運用しました。
      この経験を通して、<span class="font-bold text-white">ユーザー視点に立った使いやすいシステム設計</span>と、効果的なフロントエンド・バックエンド開発の重要性を深く理解することができました。
    </p>
    <p class="mt-4">
      また、私のもう一つの情熱であるテニスを通じて得た人脈から、
      現在は「テニスベア」というサービスの開発にも関わっています。個人事業主として契約し、
      フロントエンドとバックエンドの両方に携わりながら、ユーザーが使いやすいサービスの提供に貢献しています。
      <span class="font-bold text-white">技術的な挑戦を楽しみながら、チームとともに成長できるプロジェクトに大きなやりがい</span>を感じています。
    </p>
    <p class="mt-4">
      これまでに培った経験と技術を活かし、
      今後もユーザーフレンドリーでスケーラブルなアプリケーションの開発に挑戦していきたいと考えています。
      <span class="font-bold text-white">どんなプロジェクトにも柔軟に対応できるフルスタックエンジニア</span>として、
      常に新しい技術やアイデアを取り入れ、最良のソリューションを提供できるよう尽力します。
    </p>
  </div>
</template>